using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public enum PositionNames 
{
    背骨前後=0,
    背骨左右,
    背骨左右ひねり,
    胸部前後,
    胸部左右,
    胸部左右ひねり,
    UpperChestFrontBack,
    UpperChestLeftRight,
    UpperChestTwistLeftRight=8,
    //ここまで胴


    首うなづき前後=9,
    首傾き左右,
    首振り向き左右,
    頭うなづき前後,
    頭傾き左右,
    頭振り向き左右,
    左目上下,
    左目左右,
    右目上下,
    右目左右,
    顎開閉,
    顎左右=20,
    //ここまで頭


    左太もも前後=21,
    左太もも左右,
    左太ももひねり左右,
    左足ひざ伸ばし,
    左ひざ左右ひねり,
    左つま先伸ばし,
    左つま先ひねり左右,
    左足指先伸ばし = 28,
    //左足

    右太もも前後=29,
    右太もも左右,
    右太ももひねり左右,
    右足ひざ伸ばし,
    右ひざ左右ひねり,
    右つま先伸ばし,
    右つま先ひねり左右,
    右足指先伸ばし = 36,
    //右足

    左肩上げ下げ=37,
    左肩前後ろ,
    左上げ下げ,
    左腕前後ろ,
    左腕ひねり左右,
    左ひじ曲げ伸ばし,
    左ひじひねり左右,
    左手首前後,
    左手首左右=45,
    //左腕

    右肩上げ下げ=46,
    右肩前後ろ,
    右上げ下げ,
    右腕前後ろ,
    右腕ひねり左右,
    右ひじ曲げ伸ばし,
    右ひじひねり左右,
    右手首前後,
    右手首左右=54,
    //右腕


    左親指付け根伸ばし=55,
    左親指付け根左右,
    左親指第2関節,
    左親指第1関節=58,
    左人差し指第3関節=59,
    左人差し指付け根左右,
    左人差し指第2関節,
    左人差し指第1関節=62,
    左中指第3関節=63,
    左中指付け根左右,
    左中指第2関節,
    左中指第1関節=66,
    左薬指第3関節=67,
    左薬指付け根左右,
    左薬指第2関節,
    左薬指第1関節=70,
    左小指第3関節=71,
    左小指付け根左右,
    左小指第2関節,
    左小指第1関節=74,
    //左手

    右親指付け根伸ばし=75,
    右親指付け根左右,
    右親指第2関節,
    右親指第1関節=78,
    右人差し指第3関節,
    右人差し指付け根左右,
    右人差し指第2関節,
    右人差し指第1関節,
    右中指第3関節,
    右中指付け根左右,
    右中指第2関節,
    右中指第1関節=86,
    右薬指第3関節,
    右薬指付け根左右,
    右薬指第2関節,
    右薬指第1関節,
    右小指第3関節,
    右小指付け根左右,
    右小指第2関節,
    右小指第1関節=94,
}
